# MySQL SQL Lessons in Jupyter Notebook

This Jupyter Notebook provides a complete lesson for using MySQL with SQL commands, including DDL, DML, DQL, and TCL examples.

### Prerequisites:
- MySQL server installed and running.
- Python packages: `ipython-sql`, `mysql-connector-python`.
- Connection to MySQL database established.

### Setting Up MySQL in Jupyter Notebook
Run the following setup code to install packages and connect to your MySQL database.

In [ ]:
# Install necessary packages
%pip install ipython-sql mysql-connector-python

# Load the ipython-sql extension
%load_ext sql

# Connect to the MySQL database (Replace with your MySQL credentials)
%sql mysql+mysqlconnector://username:password@localhost/database_name

## 1. DDL (Data Definition Language)
In this section, we will cover creating, altering, and dropping tables in MySQL.

In [ ]:
%%sql
-- Create a database (if not exists) and use it
CREATE DATABASE IF NOT EXISTS test_db;
USE test_db;

-- Create the employees table
DROP TABLE IF EXISTS employees;
CREATE TABLE employees (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    hire_date DATE,
    salary DECIMAL(10, 2)
);

## 2. DML (Data Manipulation Language)
Let's insert, update, and delete records in the `employees` table.

In [ ]:
%%sql
-- Insert data into the employees table
INSERT INTO employees (first_name, last_name, hire_date, salary)
VALUES ('Alice', 'Johnson', '2023-01-15', 60000.00),
       ('Bob', 'Smith', '2023-02-10', 75000.00),
       ('Charlie', 'Brown', '2023-03-05', 50000.00);

-- Update a record
UPDATE employees
SET salary = 80000.00
WHERE first_name = 'Alice';

-- Delete a record
DELETE FROM employees
WHERE last_name = 'Brown';

## 3. DQL (Data Query Language)
Learn how to use `SELECT` statements for data retrieval, including advanced queries.

In [ ]:
%%sql
-- Basic SELECT query
SELECT * FROM employees;

-- Using column aliases
SELECT first_name AS 'First Name',
       last_name AS 'Last Name',
       salary AS 'Annual Salary'
FROM employees;

-- Filtering data with WHERE clause
SELECT *
FROM employees
WHERE salary > 60000;

-- Using ORDER BY to sort results
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC;

## 4. TCL (Transaction Control Language)
Learn how to use `COMMIT`, `ROLLBACK`, and `SAVEPOINT` for transaction control.

In [ ]:
%%sql
-- Start a transaction
START TRANSACTION;

-- Update a record within the transaction
UPDATE employees SET salary = 90000.00 WHERE first_name = 'Bob';

-- Rollback the transaction
ROLLBACK;

-- Verify the rollback
SELECT * FROM employees;

-- Using SAVEPOINT
START TRANSACTION;
SAVEPOINT sp1;
UPDATE employees SET salary = 95000.00 WHERE first_name = 'Alice';
ROLLBACK TO sp1;
COMMIT;

-- Verify the changes
SELECT * FROM employees;

## 5. Best Practices for Using MySQL in Jupyter Notebook
- Always test your queries on a small dataset before running them on production data.
- Use transactions (`START TRANSACTION`, `COMMIT`, `ROLLBACK`) to ensure data integrity.
- Use indexes on frequently queried columns to improve performance.
- Be mindful of SQL injection risks when working with user inputs.

This concludes the MySQL lesson in Jupyter Notebook. Feel free to modify the examples and practice further!